Repository: xarray-contrib/xarray.dev
Catalog: src/locales/*/messages.po
Languages: es, pt

source: © {currentYear}, Xarray core developers. Apache 2.0Licensed.
es: © {currentYear}, desarrolladores principales de Xarray. Licencia Apache 2.0.

source: 🌊 Oceanography
es: 🌊 Oceanografía
pt: 🌊 Oceanografia

source: 🌎 Geoscience
es: 🌎 Geociencias
pt: 🌎 Geociência

source: 🌪🌡 Meteorology
es: 🌪🌡 Metereología
pt: 🌪🌡 Meteorologia

source: 💊 Bioinformatics
es: 💊 Bioinformática
pt: 💊 Bioinformática

source: 🗺️ Geographic Processing
es: 🗺️ Procesamiento de datos geográficos
pt: 🗺️ Processamento Geográfico

source: A high-level plotting API for the PyData ecosystem built on HoloViews
es: Una API de gráficos de alto nivel para el ecosistema PyData construida sobre HoloViews
pt: Uma API de alto nível para o ecossistema PyData construído a partir de HoloViews

source: An implementation of chunked, compressed, N-dimensional arrays for Python.
es: Una implementación de matrices N-dimensionales, fragmentadas y comprimidas para Python.
pt: Uma implementação de matrizes N-dimensionais fatiadas e compactadas para Python.

source: Apply operations over named dimensions
es: Aplique operaciones sobre dimensiones etiquetadas
pt: Aplicar operações sobre dimensões nomeadas

source: Arbitrary metadata tracking
es: Seguimiento de metadatos arbitrarios
pt: Rastreamento de metadados arbitrários

source: Array Libraries
es: Bibliotecas de matrices
pt: Bibliotecas para Matrizes

source: Backend-agnostic tools for diagnostics and visualizations of Bayesian inference in Python
es: Herramientas independientes del backend para diagnósticos y visualizaciones de inferencia bayesiana en Python
pt: Ferramentas agnósticas de back-end para diagnósticos e visualizações de inferência Bayesiana em Python

source: Bayesian Inference
es: Inferencia Bayesiana
pt: Inferência Bayesiana

source: Brand Assets
es: Recursos de marca
pt: Material de Marketing

source: Check out the new blog post on DataTree!
es: ¡Consulta la nueva publicación del blog sobre DataTree!
pt: Confira o novo post sobre DataTree!

source: Citing Xarray
es: Citando Xarray
pt: Citando Xarray

source: Collection of tools for the analysis and visualization of spatial molecular data
es: Colección de herramientas para el análisis y visualización de datos moleculares espaciales
pt: Coleção de ferramentas para a análise e visualização de dados moleculares espaciais

source: Community
es: Comunidad
pt: Comunidade

source: Compatible Projects
es: Proyectos compatibles
pt: Projetos compatíveis

source: Contribute
es: Contribuir
pt: Contribuir

source: Dashboard
es: Tablero
pt: Painel de controle

source: Database like alignment based on coordinate labels that smoothly handles missing values.
es: Alineación similar a una base de datos basada en etiquetas de coordenadas para el manejo de forma eficiente de valores faltantes.
pt: Alinhamento tipo banco de dados baseado em rótulos de coordenadas que lidam de maneira fácil com valores faltantes.

source: Database like operations
es: Operaciones similares a bases de datos
pt: Operações do tipo banco de dados

source: Distributed arrays and advanced parallelism for analytics, enabling performance at scale.
es: Arreglos distribuidos y paralelismo avanzado para el análisis, lo que permite un rendimiento escalable.
pt: Arrays distribuídas e paralelismo avançado para análises, permitindo desempenho em escala.

source: Documentation
es: Documentación
pt: Documentação

source: Donate
es: Donar
pt: Fazer uma doação

source: Ecosystem
es: Ecosistema
pt: Ecossistema

source: English
es: Inglés

source: Example Gallery
es: Galería de ejemplos
pt: Galeria de exemplos

source: failed to load
es: Falla en la carga
pt: Falha ao carregar

source: failed to load data
es: Error al cargar los datos
pt: falha ao carregar os dados

source: Features
es: Funcionalidades
pt: Funcionalidades

source: Flexible and Extensible I/O backend API
es: API de Entrada y Salida del backend flexible y extensible
pt: API de backend I/O flexível e extensível

source: Flexible split-apply-combine operations with groupby.
es: Operaciones flexibles de división, aplicación y combinación mediante Agrupado Por.
pt: Operações flexíveis de combinação-aplicação com groupby.

source: General Circulation Model Postprocessing with xarray
es: Postprocesamiento del modelos de circulación global con Xarray
pt: Pós-processamento de modelo geral de circulação com xarray

source: Get Started
es: Primeros pasos
pt: Comece Agora

source: GitHub Discussions
es: Discusiones de GitHub
pt: Discussões no GitHub

source: GroupBy operations
es: Operaciones de Agrupado Por
pt: Operações GroupBy

source: If you like Xarray and want to support our mission, please consider making a donation to support our efforts.
es: Si te gusta Xarray y quieres apoyar nuestra misión, considera hacer una donación para apoyar nuestros esfuerzos.
pt: Se você gosta do Xarray e quer apoiar nossa missão, por favor considere fazer uma doação para apoiar nosso trabalho.

source: in the United States. NumFOCUS provides Xarray with fiscal, legal, and administrative support to help ensure the health and sustainability of the project. For more information, visit
es: En Estados Unidos. NumFOCUS proporciona a Xarray apoyo fiscal, legal y administrativo para garantizar la viabilidad y sostenibilidad del proyecto. Para más información, visite

source: Interoperability
es: Interoperabilidad
pt: Interoperabilidade

source: Interoperable with the scientific Python ecosystem including NumPy, Dask, Pandas, and Matplotlib.
es: Interoperabilidad con el ecosistema científico de Python, incluyendo NumPy, Dask, Pandas y Matplotlib.
pt: Interoperável com o ecossistema científico de Python, incluindo NumPy, Dask, Pandas e Matplotlib.

source: Issue Tracker
es: Listado de reportes
pt: Rastreador de Problemas

source: Key Features & Capabilities
es: Características y capacidades
pt: Principais Recursos & Funcionalidades

source: loading...
es: cargando...
pt: carregando...

source: Mailing List
es: Lista de correos
pt: Lista de Emails

source: Mathematical operations vectorize across multiple dimensions (array broadcasting) based on dimension names, not shape.
es: Las operaciones matemáticas se vectorizan en múltiples dimensiones en función de los nombres de las dimensiones, no de la forma.
pt: Operações matemáticas são vetorizadas em várias dimensões (broadcasting de matrizes) com base em nomes de dimensão, não no formato da matriz.

source: N-D labeled arrays and datasets in Python
es: Arreglos y conjuntos de datos n-dimensionales etiquetados en Python
pt: Matrizes e conjuntos de dados N-D rotulados em Python

source: NumPy is the fundamental package for array computing with Python.
es: NumPy es el paquete fundamental para la computación de matrices/arreglos con Python.
pt: NumPy é o pacote fundamental para a computação de matrizes com Python.

source: NumPy-compatible array library for GPU-accelerated computing with Python.
es: Biblioteca de matrices/arreglos compatible con NumPy para computación acelerada por GPU con Python.
pt: Biblioteca de matrizes compatível com NumPy para computação acelerada pela GPU com Python.

source: Operate and manipulate physical quantities in Python
es: Opere y manipule cantidades físicas en Python.
pt: Opere e manipule quantidades físicas em Python

source: Portuguese
es: Portugués

source: Python library for processing spatial data and interpolating it on regular grids
es: Biblioteca Python para procesar datos espaciales e interpolarlos en cuadrículas regulares
pt: Biblioteca Python para processar dados espaciais e interpolá-los em malhas regulares

source: Read and write data to and from NetCDF, HDF, Zarr, OpenDAP, and GRIB.
es: Lea y escriba datos desde y hacia NetCDF, HDF, Zarr, OpenDAP y GRIB.
pt: Ler e gravar dados NetCDF, HDF, Zarr, OpenDAP e GRIB.

source: Resources
es: Recursos
pt: Recursos

source: Roadmap
es: Plan de trabajo
pt: Planejamento

source: Scientific Domains
es: Dominios científicos
pt: Domínios científicos

source: See More
es: Ver más
pt: Veja mais

source: Select values by label instead of integer location
es: Seleccione valores por etiqueta en lugar de ubicación entera
pt: Selecione os valores por rótulo em vez do índice inteiro

source: Spanish
es: Español

source: Sparse multi-dimensional arrays for the PyData ecosystem
es: Arreglos multidimensionales dispersos para el ecosistema PyData
pt: Matrizes esparsas multidimensionais para o ecossistema PyData

source: Sponsors
es: Patrocinadores
pt: Patrocinadores

source: Stars
es: Estrellas
pt: Estrelas

source: Supported By
es: Con el apoyo de
pt: Apoiado por

source: Team
es: Equipo
pt: Equipe

source: This is a timeline of how many open issues and pull requests Xarray has on Github over time from {0} to
es: Esta es una cronología de cuántos reportes y Pull Requests tiene Xarray en Github a lo largo del tiempo desde {0} hasta
pt: Esta é uma linha do tempo de quantas issues abertas e pull requests o Xarray tem no GitHub ao longo do tempo de {0} até

source: This section lists some of the standalone packages, projects developed with xarray.
es: En esta sección se enumeran algunos de los paquetes independientes y proyectos desarrollados con xarray.
pt: Esta seção lista alguns pacotes autônomos e projetos desenvolvidos com xarray.

source: Try
es: Pruebe
pt: Experimentar

source: Try Xarray in a REPL directly in your browser (no installation needed)!
es: ¡Pruebe Xarray en un REPL directamente en su navegador (no necesita instalación)!
pt: Experimente o Xarray em uma REPL diretamente no seu browser (não é necessário instalar nada)!

source: Tutorials
es: Tutoriales
pt: Tutoriais

source: Vectorized operations
es: Operaciones vectorizadas
pt: Operações vetorizadas

source: Verification of weather and climate forecasts
es: Verificación de predicciones meteorológicas y climáticas.
pt: Verificação do tempo e previsão do clima

source: We thank these institutions for generously supporting the development and maintenance of Xarray.
es: Agradecemos a estas instituciones por apoyar generosamente el desarrollo y mantenimiento de Xarray.
pt: Agradecemos essas instituições por apoiarem generosamente o desenvolvimento e a manutenção do Xarray.

source: Why Xarray?
es: ¿Por qué Xarray?
pt: Por que Xarray?

source: Xarray includes a large and growing library of domain-agnostic functions for advanced analytics and visualization with these data structures.
es: Xarray incluye una biblioteca grande y en crecimiento de funciones independientes del dominio para análisis y visualización avanzados con estas estructuras de datos.
pt: Xarray inclui uma grande e crescente biblioteca de funções agnósticas de domínio para análises avançadas e visualização com estas estruturas de dados.

source: Xarray is a NumFOCUS Sponsored Project, a
es: Xarray es un proyecto patrocinado por NumFOCUS, una

source: Xarray is an open source project and Python package that introduces labels in the form of dimensions, coordinates, and attributes on top of raw NumPy-like arrays, which allows for more intuitive, more concise, and less error-prone user experience.
es: Xarray es un proyecto de código abierto y un paquete de Python que introduce etiquetas en forma de dimensiones, coordenadas y atributos sobre conjuntos de datos similares a NumPy, lo que permite una experiencia de usuario más intuitiva, más concisa y menos propensa a errores.
pt: Xarray é um projeto de código aberto e pacote Python que introduz rótulos na forma de dimensões, coordenadas e atributos em matrizes do tipo NumPy, que permitem uma experiência do usuário mais intuitiva, mais concisa e menos propensa a erros.

source: Xarray is part of the larger scientific Python ecosystem. It is built on top of NumPy, Pandas, and Dask and supports a wide range of domain specific scientific applications.
es: Xarray forma parte del ecosistema científico más amplio de Python. Está desarrollado sobre NumPy, Pandas y Dask y es compatible con una amplia gama de aplicaciones científicas específicas del dominio.
pt: Xarray é parte do ecossistema científico de Python. É construído a partir da NumPy, do Pandas e do Dask e suporta uma ampla gama de aplicativos científicos específicos.

source: Xarray Issue Tracker
es: Listado de reportes
pt: Rastreador de Problemas Xarray

source: Xarray Project Metrics
es: Métricas del proyecto
pt: Métricas do Projeto Xarray

source: Xarray project statistics
es: Métricas del proyecto
pt: Métricas do Projeto Xarray

source: Xarray provides data models for working with labeled arrays and datasets. Its toolkit includes a broad set of domain-agnostic functions for advanced analytics and visualization with these data structures.
es: Xarray proporciona modelos de datos para trabajar con conjuntos de datos etiquetados. Su conjunto de herramientas incluye un amplio conjunto de funciones independientes del dominio para análisis y visualización con estas estructuras de datos.
pt: Xarray fornece modelos de dados para trabalhar com matrizes e conjuntos de dados rotulados. Seu kit de ferramentas inclui um amplo conjunto de funções agnósticas de domínio para análise avançada e visualização com estas estruturas de dados.

source: Xarray supports multiple array backends, allowing users to choose array types that work best for their application.
es: Xarray admite múltiples motores, lo que permite a los usuarios elegir los tipos de estructuras de datos que funcionan mejor para su aplicación.
pt: O Xarray suporta vários backends de matrizes, permitindo que os usuários escolham tipos de matrizes que funcionam melhor para sua aplicação.

source: Xarray x NASA: xarray.DataTree for hierarchical data structures
es: Xarray x NASA: xarray.DataTree para estructuras de datos jerárquicas
pt: Xarray x NASA: xarray.DataTree para estruturas de dados hierárquicas

source: Xarray: N-D labeled arrays and datasets in Python
es: Arreglos y conjuntos de datos n-dimensionales etiquetados en Python
pt: Xarray: matrizes N-D rotuladas e conjuntos de dados em Python

source: Raster-based Spatial Analytics for Python
pt: Análise Espacial baseada em rasterização para Python
